# Data Cleaning and Preparation

## Handing Missing data

In [56]:
import pandas as pd 
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [10]:
data = pd.Series([1, np.nan, 3.5, np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# Above is eqivalent to 
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1, 6.5,3], [1,np.nan,np.nan],
                    [np.nan,np.nan,np.nan], [np.nan, 6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
# dropna by default drops any rows containging a missing value
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
# passing how='all' will only drop rows that are all NA:
data.dropna(how = 'all')
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
# to drop columns in the same way, pass axis =1
data[4] = np.nan
data

     0    1    2   4   3
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [24]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.690136 -0.492714 -1.119537
1 -1.500472 -0.558319  1.500758
2  2.723418 -1.473523  1.454743
3 -0.284355 -0.801872  0.558029
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [28]:
df.iloc[:4,1] = np.nan
df

          0         1         2
0  0.690136       NaN -1.119537
1 -1.500472       NaN  1.500758
2  2.723418       NaN  1.454743
3 -0.284355       NaN  0.558029
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [32]:
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.690136       NaN       NaN
1 -1.500472       NaN       NaN
2  2.723418       NaN  1.454743
3 -0.284355       NaN  0.558029
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [33]:
df.dropna()

          0         1         2
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [54]:
df.iloc[:3,0] = np.nan
df

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       NaN       NaN  1.454743
3 -0.284355       NaN  0.558029
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [56]:
# keep only rows with at least 3 non-na values
df.dropna(thresh = 3)

          0         1         2
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

## Filling In Missing Data

In [60]:
df.fillna(0,inplace = True)
df

          0         1         2
0  0.000000  0.000000  0.000000
1  0.000000  0.000000  0.000000
2  0.000000  0.000000  1.454743
3 -0.284355  0.000000  0.558029
4  0.877221 -0.658127  0.046360
5  1.563043 -1.534419  1.108126
6  0.400909 -1.525165  0.292926

In [62]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.954416  0.785161 -0.198153
1  1.998309  0.072585  0.910363
2 -0.483596  1.463553  0.768684
3  1.887141 -1.189383  1.527561
4 -1.300751 -1.097711 -0.767184
5  1.022066 -0.999008 -0.066072

In [63]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0  0.954416  0.785161 -0.198153
1  1.998309  0.072585  0.910363
2 -0.483596       NaN  0.768684
3  1.887141       NaN  1.527561
4 -1.300751       NaN -0.767184
5  1.022066       NaN -0.066072

In [65]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0  0.954416  0.785161 -0.198153
1  1.998309  0.072585  0.910363
2 -0.483596       NaN  0.768684
3  1.887141       NaN  1.527561
4 -1.300751       NaN       NaN
5  1.022066       NaN       NaN

In [68]:
df.fillna(method = 'ffill',limit =2, inplace = True)
df

          0         1         2
0  0.954416  0.785161 -0.198153
1  1.998309  0.072585  0.910363
2 -0.483596  0.072585  0.768684
3  1.887141  0.072585  1.527561
4 -1.300751  0.072585  1.527561
5  1.022066  0.072585  1.527561

In [69]:
# pass mean or median value of a series:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [70]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

###  Removing Duplicates

In [72]:
data = pd.DataFrame({'k1': ['one','two']*3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [73]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [74]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [75]:
data['v1'] = range(7)

In [76]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [77]:
# want to filter duplicates only based on the "k1" column:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [78]:
# passing keep = 'last' will return the last one
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data using a function or mapping

In [92]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'pastrami', 'corned beef','Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [96]:
# suppose you wanted to add a columns indicating the type of animal that each food came from 
meat_to_animal = {'bacon':'pig',
                  'pulled pork':'pig',
                  'pastrami':'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'}

In [97]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [98]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [99]:
#also
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

note: using map is a convenient way to perform element - wise transformaoins and other data cleaning-related operations

### Replacing Values

In [4]:
data = pd.Series([1,-999,2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [5]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [6]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [7]:
data.replace([-999,-1000],[np.nan , 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [8]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis indexes

In [57]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
#without modifying the orginal
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [60]:
data.rename(index = {'OHIO':'INDIANA'},
           columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [61]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [62]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [65]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [66]:
# divide these into 18 to 25, 26 to 35, 36 to 60 and finally 61 and older
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [68]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [69]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [70]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [73]:
pd.cut(ages,[18, 26 , 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [75]:
# pass your own bins name 
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(age, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]